pitlab/Kamera-OV9655-na-STM32F746G-DISCO/Core/Src/main.c
  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : DCMI_PWR_EN_Pin */
  GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void vApplicationIdleHook( void )
{

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_HOST */
  MX_USB_HOST_Init();

  /* init code for LWIP */
  MX_LWIP_Init();
  /* USER CODE BEGIN 5 */
  const char* message = "Hello UDP message!\n\r";
  static uint8_t bufor_kamery[1280 * 1024 * 2] __attribute__((section(".BuforKamery")));
  static uint8_t bufor_okna[320 * 240 * 2] __attribute__((section(".BuforLCD1")));
  static uint8_t bufor_ekranu[480 * 272 * 4] __attribute__((section(".BuforLCD0")));
  char chNapis[30];
  uint8_t chZrobione = 0;
  uint8_t chFilm = 0;
  TS_StateTypeDef touch;
  HAL_StatusTypeDef err;
  extern float fImag;
  uint8_t chStartFraktal = 0;
  uint32_t nCzas;

  osDelay(1000);

  ip_addr_t PC_IPADDR;
  IP_ADDR4(&PC_IPADDR, 192, 168, 1, 111);

  struct udp_pcb* my_udp = udp_new();
  udp_connect(my_udp, &PC_IPADDR, 55151);
  struct pbuf* udp_buffer = NULL;



  /* Infinite loop */
  for (;;) {
    osDelay(100);
    /* !! PBUF_RAM is critical for correct operation !! */
    udp_buffer = pbuf_alloc(PBUF_TRANSPORT, strlen(message), PBUF_RAM);

    if (udp_buffer != NULL) {
      memcpy(udp_buffer->payload, message, strlen(message));
      udp_send(my_udp, udp_buffer);
      pbuf_free(udp_buffer);
    }

    BSP_LED_Toggle(0);
    BSP_TS_GetState(&touch);

    BSP_LCD_SelectLayer(0);
    sprintf(chNapis, "X=%d, T=%d  ", touch.touchX[0], touch.touchY[0]);
    BSP_LCD_DisplayStringAt(KLAW_POZ_X, 220, (uint8_t*)chNapis, LEFT_MODE);
    sprintf(chNapis, "T=%d, W=%d  ", touch.touchDetected, touch.touchWeight[0]);
    BSP_LCD_DisplayStringAt(KLAW_POZ_X, 240, (uint8_t*)chNapis, LEFT_MODE);

    if (touch.touchDetected == 0)
    	chZrobione = 0;


    //przycisk zrób zdjęcie
    if ((touch.touchDetected >= 1) && (touch.touchX[0] >= KLAW_POZ_X)  && (touch.touchY[0] >= KLAW1_Y) && (touch.touchY[0] < (KLAW1_Y + KLAW_ROZ_Y)) && !chZrobione)
    {
    	err = BSP_CAMERA_SnapshotStart(bufor_okna);
    	chZrobione = 1;
    	chStartFraktal = 0;
    }

    //przycisk rozpocznij/zakończ film
    if ((touch.touchDetected >= 1) && (touch.touchX[0] >= KLAW_POZ_X)  && (touch.touchY[0] >= KLAW2_Y) && (touch.touchY[0] < (KLAW2_Y + KLAW_ROZ_Y)) && !chZrobione)
	{
    	if (chFilm)
    	{
    		BSP_CAMERA_Suspend();
    		sprintf(chNapis, "Start Film");
			chFilm = 0;
    	}
    	else
    	{
			BSP_CAMERA_ContinuousStart(bufor_okna);
			sprintf(chNapis, "Stop Film ");
			chFilm = 1;
    	}

    	//zmień status przycisku Start/Stop Film
		BSP_LCD_SelectLayer(0);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetBackColor(LCD_COLOR_GREEN);
		BSP_LCD_DisplayStringAt(KLAW_POZ_X+5, KLAW2_Y+NAPIS_OFFY, (uint8_t*)chNapis, LEFT_MODE);
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);	//przywróć kolor tła
    	chStartFraktal = 0;
    	chZrobione = 1;
	}

	//przycisk
	if ((touch.touchDetected >= 1) && (touch.touchX[0] >= KLAW_POZ_X)  && (touch.touchY[0] >= KLAW3_Y) && (touch.touchY[0] < (KLAW3_Y + KLAW_ROZ_Y)) && !chZrobione)
	{


	}

	//przycisk fraktalada
	if ((touch.touchDetected >= 1) && (touch.touchX[0] >= KLAW_POZ_X)  && (touch.touchY[0] >= KLAW4_Y) && (touch.touchY[0] < (KLAW4_Y + KLAW_ROZ_Y)) && !chZrobione)
	{
		InitFraktal(0);
		chStartFraktal = 1;
		chZrobione = 1;
	}



	if (chStartFraktal)
	{
		nCzas = HAL_GetTick();
		GenerateJulia(320, 240, 160, 120, 135, (unsigned short *)bufor_okna);
		fImag -= 0.002;
		nCzas = MinalCzas(nCzas);

		BSP_LCD_SelectLayer(1);
		sprintf(chNapis, "Julia: t=%ldms, c=%.3f ", nCzas, fImag);
		BSP_LCD_DisplayStringAt(6, 224, (uint8_t*)chNapis, LEFT_MODE);
	}

    /*BSP_LCD_SetTransparency(0, chTransparency);
    sprintf(buftxt, "transp: %d", chTransparency);
    BSP_LCD_DisplayStringAt(0, 30, (uint8_t*)buftxt, LEFT_MODE);
    chTransparency++;
    chTransparency &= 0xFF;*/
  }
  /* USER CODE END 5 */
}

